Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Baseline Load Test
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Fetch Lawyers List API Test"
    flow:
      - get:
          url: "/get-lawyers"
          expect:
            - statusCode: 200
